# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:

# print('Lab Started , no freaking clue what sakila is and where to get it')

# Buenas tardes,
# Existen un par de erratas en el lab [importing-exporting-data]. A continuación, os indico las instrucciones para poder realizar los Challenges 1 y 3 (en el lab se repite el nombre Challenge 2, por lo tanto me refiero al tercer challenge).
# Challenge 1. Por favor, descargaros desde el siguiente enlace el fichero .db y ejecutar las operaciones que se indican, es decir, conectarse a la base de datos desde Jupyter y realizar al menos una operación de JOIN entre las tablas (este fichero es un fichero diferente pero que igualmente contiene varias tablas).
# Challenge 3. En este caso el fichero al que se hace referencia tampoco se encuentra dentro de la carpeta data, por lo que podréis descargar en este enlace un fichero .zip para hacer las operaciones que se indican en el challenge, es decir, importar con pandas el fichero, en este caso .txt , y colocar el nombre a las columnas. Solo hay una variante y es que 23 de los 24 nombres de las columnas tenéis que extraerlos del otro fichero .csv que se encuentra dentro del mismo challenge3.zip
# Podéis dejar estos nuevos ficheros de datos en la carpeta data del lab.
# Cualquier duda nos comentáis!!!

Lab Started no freaking clue what sakila is and where to get it

In [10]:
# your code here

%load_ext sql
%config SqlMagic.autocommit = False


%sql sqlite:////home/usuario/Documentos/Ironhack/Labs/dataptmad0420/module-1/importing-exporting-data/data/juliarochflores.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%%sql tables <<

SELECT 
    name
FROM 
    sqlite_master 
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';

 * sqlite:////home/usuario/Documentos/Ironhack/Labs/dataptmad0420/module-1/importing-exporting-data/data/juliarochflores.db
Done.
Returning data to local variable tables

In [18]:
tables.DataFrame()

            name
0      rank_info
1  personal_info
2  business_info

In [27]:
%%sql challenge_1 <<

SELECT 
ri.id, ri.name, bi.source, bi.worth, pi.lastName, pi.age 
FROM
rank_info ri left join business_info bi on ri.id = bi.id
left join personal_info pi on bi.id = pi.id;

 * sqlite:////home/usuario/Documentos/Ironhack/Labs/dataptmad0420/module-1/importing-exporting-data/data/juliarochflores.db
Done.
Returning data to local variable challenge_1

In [28]:
challenge_1.DataFrame()

,id,name,Source,worth,lastName,age
0,6367,ananT ASAVABHOKHIN & family,None,None,None,None
1,7613,arash FERDOWSI,None,None,None,None
2,6139,banthoon LAMSAM & FAMILY,None,None,None,None
3,5671,bill ADDERLEY & family,None,None,None,None
4,2117,boris zINGArevich,None,None,None,None
...,...,...,...,...,...,...
2255,4506,zhao XIAOQiang,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,ZHAO,51 years old
2256,6986,zHOU LIANgzhang,Manufacturing ==> electrical equipment,1.0 BUSD,zhOU,55 years old
2257,1828,zhu XINGMIng,Manufacturing ==> electrical equipment,1.0 BUSD,zHU,51 years old
2258,6448,ZHUO JUN,Manufacturing ==> printed circuit boards,1.0 BUSD,ZHUO,52 years old
2259,1860,olguN ZOrlu,Diversified ==> diversified,1.0 BUSD,zoRLu,54 years old

# Challenge 2 - Working with JSON files

Import the pandas library.

In [2]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [28]:
# your code here

absolute_path = '/home/usuario/Documentos/Ironhack/Labs/dataptmad0420/module-1/importing-exporting-data/data'
nasa = pd.read_json(f'{absolute_path}/nasa.json',  orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [29]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [20]:
# your code here
nasa['fall'].value_counts()

print('--------')

nasa['fall'].value_counts()/len(nasa)*100

--------

Fell     99.6
Found     0.4
Name: fall, dtype: float64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [30]:
# your code here
nasa.to_json(f'{absolute_path}/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [32]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [33]:
# your code here

shuttle = pd.read_csv(tst_url, names=cols, sep=' ')
display(shuttle)

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1
...,...,...,...,...,...,...,...,...,...
80,0,84,0,-36,-29,4,120,116,5
55,0,81,0,-20,25,26,102,76,4
55,0,77,0,12,-22,22,65,42,4
37,0,103,0,18,-16,66,85,20,1
56,2,98,0,52,1,42,46,4,4

Let's verify that this worked by looking at the `head()` function.

In [34]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [38]:
# Your code here:
shuttle.to_csv(f'{absolute_path}/shuttle.csv',index=False, sep=',')

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [39]:
# your code here
astronaut= pd.read_excel(f'{absolute_path}/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [40]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [43]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                                          35
Aerospace Engineering                            33
Mechanical Engineering                           30
Aeronautical Engineering                         28
Electrical Engineering                           23
                                                 ..
Earth & Planetary Science                         1
Electrical Engineering; Computer Science          1
Ecological Science                                1
Biochemistry                                      1
Business Management; Aeronautical Engineering     1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [44]:
# your code here

astronaut.to_csv(f'{absolute_path}/astronaut.csv',index=False, sep='\t')

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [46]:
# Your code here:
fertility_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt'
List = ['Season','Age','Childish diseases','Accident','Surgical Interv','HIgh Fevers','Frequency Alcohol','Smoking Habit','Hours Spent','Output']
fertility = pd.read_table(fertility_url,sep=',',names=List)

fertility.head()

,Season,Age,Childish diseases,Accident,Surgical Interv,HIgh Fevers,Frequency Alcohol,Smoking Habit,Hours Spent,Output
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O